// ConsoleApplication75.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int a[10];
    int n,i,i2;
    printf_s("N: ");
    scanf_s("%i", &n);
    for (i = 0; i < n; ++i) {
        printf_s("a[%i] : ", i + 1);
        scanf_s("%i", &a[i]);
    }
    for (i = 0; i < n - 1; ++i) {
        for (i2 = i + 1; i2 < n; ++i2) {
            if (a[i] == a[i2]) {
                printf_s("%i %i\n", i + 1, i2 + 1);
            }
        }
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
